public/man/man1/git-verify-pack.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-verify-pack.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-verify-pack.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-verify-pack - Validate packed Git archive files</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git verify-pack [-v | --verbose] [-s | --stat-only] [--] &lt;pack&gt;.idx...
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Reads given idx file for packed Git archive created with the <em>git
pack-objects</em> command and verifies the idx file and the corresponding
pack file.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>&lt;pack&gt;.idx …</p>
<blockquote>
<p>The idx files to verify.</p>
</blockquote>
<p>
-v, –verbose</p>
<blockquote>
<p>After verifying the pack, show the list of objects contained in the pack
and a histogram of delta chain length.</p>
</blockquote>
<p>
-s, –stat-only</p>
<blockquote>
<p>Do not verify the pack contents; only show the histogram of delta chain
length. With <strong>–verbose</strong>, the list of objects is also shown.</p>
</blockquote>
<p>
–</p>
<blockquote>
<p>Do not interpret any more arguments as options.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
OUTPUT FORMAT
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>When specifying the -v option the format used is:</p>
<blockquote>
<pre class="example">
SHA-1 type size size-in-packfile offset-in-packfile
</pre>
</blockquote>
<p>
for objects that are not deltified in the pack, and</p>
<blockquote>
<pre class="example">
SHA-1 type size size-in-packfile offset-in-packfile depth base-SHA-1
</pre>
</blockquote>
<p>
for objects that are deltified.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
GIT
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
